Repository: winx402/blocks-mac
Catalog: apps/Blocks/BlocksApp/Features/Screenshot/Resources/ScreenshotLocalizable.xcstrings
Source language: zh_hans
Languages: en, ja

# settings.screenshot.capturePreview.cancelled
source: 已关闭长截图预览
en: Scrolling capture preview closed
ja: スクロールキャプチャのプレビューを閉じました

# settings.screenshot.retainsCaptureDefaults
source: 固定捕获设置
en: Keep capture settings fixed
ja: 撮影設定を固定

# settings.screenshot.retainsCaptureDefaults.detail
source: 每次截图按这里的设置开始；关闭后沿用上次截图时的修改。
en: Start every capture from these settings. Turn off to reuse the last session changes.
ja: 毎回この設定から開始します。オフにすると直前の変更を引き継ぎます。

# settings.screenshot.cursor
source: 包含鼠标指针
en: Include pointer
ja: ポインタを含める

# settings.screenshot.delay
source: 延迟截图
en: Delay
ja: 遅延

# settings.screenshot.delay.none
source: 无
en: None
ja: なし

# settings.screenshot.detail
source: 配置截图行为、编辑工具栏、工具与输出。
en: Capture behavior, editor toolbar, tools, and output.
ja: 撮影動作、編集ツールバー、ツール、出力を設定します。

# settings.screenshot.editor
source: 编辑器
en: Editor
ja: エディタ

# settings.screenshot.confirmsDiscardBeforeClosing
source: 丢弃编辑前确认
en: Confirm before discarding edits
ja: 編集を破棄する前に確認

# settings.screenshot.confirmsDiscardBeforeClosing.detail
source: 关闭或替换已编辑截图前显示确认。
en: Show a confirmation before closing or replacing an edited screenshot.
ja: 編集済みスクリーンショットを閉じる、または置き換える前に確認します。

# settings.screenshot.format
source: 默认格式
en: Default format
ja: 既定の形式

# settings.screenshot.freeze
source: 冻结画面
en: Freeze frame
ja: 画面を固定

# settings.screenshot.jpegQuality
source: JPEG 质量
en: JPEG quality
ja: JPEG 品質

# settings.screenshot.automaticallyRecognizesHistory
source: 自动识别剪贴板历史截图中的文字
en: Automatically recognize text in Clipboard history screenshots
ja: クリップボード履歴のスクリーンショット内の文字を自動認識

# settings.screenshot.automaticallyRecognizesHistory.detail
source: 对之后保存到剪贴板历史的截图执行本地 OCR。
en: Run local OCR for screenshots saved to Clipboard history from now on.
ja: 今後クリップボード履歴に保存するスクリーンショットにローカル OCR を実行します。

# settings.screenshot.output
source: 输出
en: Output
ja: 出力

# settings.screenshot.shadow
source: 包含窗口阴影
en: Include window shadow
ja: ウィンドウの影を含める

# settings.screenshot.shortcut
source: 智能截图快捷键
en: Smart screenshot shortcut
ja: スマートスクリーンショットのショートカット

# settings.screenshot.shortcut.detail
source: 前往快捷键设置修改全局触发键。
en: Configure the global shortcut in Shortcut settings.
ja: ショートカット設定でグローバルキーを変更します。

# settings.screenshot.shortcut.open
source: 打开快捷键设置
en: Open Shortcut Settings
ja: ショートカット設定を開く

# settings.screenshot.title
source: 截图设置
en: Screenshot settings
ja: スクリーンショット設定

# settings.screenshot.close
source: 关闭
en: Close
ja: 閉じる

# settings.screenshot.regionConstraint
source: 区域比例
en: Region constraint
ja: 範囲比率

# settings.screenshot.regionConstraint.free
source: 自由
en: Free

# settings.screenshot.restoreSection
source: 恢复本组默认值
en: Restore this section
ja: このセクションを復元

# settings.screenshot.tools
source: 工具
en: Tools
ja: ツール

# settings.screenshot.toolLayout
source: 工具布局
en: Tool layout
ja: ツール配置

# settings.screenshot.tools.configure
source: 配置工具
en: Configure tools
ja: ツールを設定

# settings.screenshot.tools.configureNamed
source: 打开工具设置（预览：%@）
en: Open tool settings (preview: %@)
ja: ツール設定を開く（プレビュー：%@）

# settings.screenshot.tools.detail
source: 在快捷、更多和隐藏区域之间拖动工具。
en: Drag tools between quick, more, and hidden zones.
ja: ツールをクイック、その他、非表示の各領域へドラッグします。

# settings.screenshot.tools.expanded
source: 更多工具
en: More tools
ja: その他のツール

# settings.screenshot.tools.quick
source: 快捷工具
en: Quick toolbar
ja: クイックツール

# settings.screenshot.tools.movable
source: 可移动工具
en: Movable tool
ja: 移動可能なツール

# settings.screenshot.tools.movableInZone
source: 当前区域：%@；可移动工具
en: Current zone: %@; movable tool
ja: 現在の領域：%@、移動可能なツール

# settings.screenshot.tools.restore
source: 恢复工具顺序和显隐
en: Restore tool order and visibility
ja: ツールの順序と表示を復元

# settings.screenshot.tools.add
source: 添加工具
en: Add tool
ja: ツールを追加

# settings.screenshot.tools.hide
source: 隐藏工具
en: Hide tool
ja: ツールを隠す

# settings.screenshot.tools.moveToExpanded
source: 移到更多工具
en: Move to More tools
ja: その他のツールへ移動

# settings.screenshot.tools.moveToHidden
source: 移到隐藏工具
en: Move to Hidden tools
ja: 非表示のツールへ移動

# settings.screenshot.tools.moveToQuick
source: 移到快捷工具
en: Move to Quick toolbar
ja: クイックツールへ移動

# settings.screenshot.tools.fixed
source: 固定工具
en: Fixed tool
ja: 固定ツール

# settings.screenshot.tools.library
source: 隐藏工具库
en: Hidden tools
ja: 非表示のツール

# settings.screenshot.tools.library.empty
source: 所有工具均已显示
en: All tools are visible
ja: すべてのツールが表示されています

# settings.screenshot.workbench
source: 截图设置工作台
en: Screenshot workbench
ja: スクリーンショットワークベンチ

# settings.screenshot.workbench.detail
source: 默认值将应用到下一次截图。
en: Defaults apply to your next capture.
ja: 既定値は次回の撮影に適用されます。

# screenshot.selection.allDisplays
source: 全部屏幕
en: All displays
ja: すべてのディスプレイ

# screenshot.selection.accessibility.canvas
source: 智能截图选择
en: Smart screenshot selection
ja: スマートスクリーンショット選択

# screenshot.selection.accessibility.toolbar
source: 截图选择工具栏
en: Screenshot selection toolbar
ja: スクリーンショット選択ツールバー

# screenshot.selection.accessibility.readyAnnouncement
source: 智能截图选择已就绪。单击窗口、拖拽区域或使用键盘快捷键。
en: Smart screenshot selection ready. Click a window, drag a region, or use the keyboard shortcuts.
ja: スマートスクリーンショット選択の準備ができました。ウィンドウをクリックするか、範囲をドラッグするか、キーボードショートカットを使用してください。

# screenshot.selection.accessibility.scrollingReadyAnnouncement
source: 长截图区域已就绪。可开始、重新选择或取消。
en: Scrolling capture region ready. Start, reselect, or cancel.
ja: スクロールキャプチャ範囲の準備ができました。開始、範囲の再選択、またはキャンセルを選んでください。

# screenshot.selection.accessibility.dragging
source: 正在拖动
en: Dragging
ja: ドラッグ中

# screenshot.selection.accessibility.ready
source: 可拖动
en: Ready to drag
ja: ドラッグ可能

# screenshot.selection.accessibility.previewLocked
source: 设置预览中不可拖动
en: Fixed in settings preview
ja: 設定プレビューでは固定

# screenshot.selection.accessibility.selected
source: 已选择
en: Selected
ja: 選択中

# screenshot.selection.accessibility.unselected
source: 未选择
en: Not selected
ja: 未選択

# screenshot.selection.constraint
source: 尺寸
en: Size
ja: サイズ

# screenshot.selection.constraint.free
source: 自由
en: Free

# screenshot.selection.constraint.custom
source: 自定义比例…
en: Custom ratio…
ja: カスタム比率…

# screenshot.editor.aspect.unlock
source: 解除比例绑定
en: Remove aspect ratio lock
ja: 縦横比の固定を解除

# screenshot.editor.aspect.free
source: 自由比例
en: Free aspect ratio
ja: 自由比率

# screenshot.editor.moreTools
source: 更多工具
en: More tools
ja: その他のツール

# screenshot.editor.moreTools.count
source: 更多工具（%d）
en: More tools (%d)
ja: その他のツール（%d）

# screenshot.selection.cursor
source: 指针
en: Pointer
ja: ポインタ

# screenshot.selection.delay
source: 延迟
en: Delay
ja: 遅延

# screenshot.selection.freeze
source: 冻结
en: Freeze
ja: 固定

# screenshot.selection.dragHandle
source: 拖动工具栏
en: Move toolbar
ja: ツールバーを移動

# screenshot.selection.hint.display
source: 单击屏幕捕获 · Esc 取消
en: Click a display to capture · Esc cancel
ja: ディスプレイをクリックして撮影 · Esc キャンセル

# screenshot.selection.hint.noCandidate
source: 没有可选窗口 · 拖拽选择区域 · Esc 取消
en: No window available · Drag a region · Esc cancel
ja: 選択可能なウィンドウはありません · 範囲をドラッグ · Esc キャンセル

# screenshot.selection.hint.ready
source: 单击 / 拖拽 · Space 锁定 · Tab 切换 · F 屏幕 · Shift+F 全部
en: Click / drag · Space lock · Tab cycle · F display · Shift+F all
ja: クリック / ドラッグ · Space 固定 · Tab 切替 · F 画面 · Shift+F 全画面

# screenshot.selection.hint.regionDrawing
source: 松开以捕获区域 · Esc 取消
en: Release to capture region · Esc cancel
ja: 離して範囲を撮影 · Esc キャンセル

# screenshot.selection.hint.smart
source: 单击窗口 · 拖拽区域 · Space 锁定 · Tab 切换 · F 屏幕
en: Click window · Drag region · Space lock · Tab cycle · F display
ja: ウィンドウをクリック · 範囲をドラッグ · Space 固定 · Tab 切替 · F ディスプレイ

# screenshot.selection.hint.window
source: 单击窗口 · Space 锁定 · Tab 切换 · F 屏幕 · Shift+F 全部
en: Click window · Space lock · Tab cycle · F display · Shift+F all
ja: ウィンドウをクリック · Space 固定 · Tab 切替 · F 画面 · Shift+F 全画面

# screenshot.selection.reset
source: 重置
en: Reset
ja: リセット

# screenshot.selection.shadow
source: 阴影
en: Shadow
ja: 影

# screenshot.ocr.copied
source: 识别文字已复制
en: Recognized text copied
ja: 認識したテキストをコピーしました

# screenshot.ocr.copy
source: 复制
en: Copy
ja: コピー

# screenshot.ocr.dragHint
source: 拖动选择需要识别的区域
en: Drag over the area to recognize
ja: 認識する範囲をドラッグしてください

# screenshot.ocr.failed
source: 文字识别失败
en: Text recognition failed
ja: テキスト認識に失敗しました

# screenshot.ocr.recognizing
source: 正在识别文字…
en: Recognizing text…
ja: テキストを認識中…

# screenshot.ocr.result
source: 识别结果
en: Recognized text
ja: 認識したテキスト

# screenshot.ocr.retry
source: 重试
en: Retry
ja: 再試行

# screenshot.ocr.timedOut
source: 文字识别超时
en: Text recognition timed out
ja: テキスト認識がタイムアウトしました

# screenshot.history.outputBothFailed
source: 截图未能复制，也未能保存到历史。
en: The screenshot could not be copied or saved to history.
ja: スクリーンショットをコピーまたは履歴に保存できませんでした。

# screenshot.history.outputCopyFailed
source: 截图已保存到历史，但未能复制。
en: The screenshot was saved to history, but could not be copied.
ja: 履歴には保存されましたが、コピーできませんでした。

# screenshot.history.saveFailed
source: 历史保存失败
en: History save failed
ja: 履歴の保存に失敗しました

# screenshot.history.saveFailedDetail
source: 截图已复制，但未能保存到历史。
en: The screenshot was copied, but could not be saved to history.
ja: コピーされましたが、履歴に保存できませんでした。

# status.editingContextUnavailable.detail
source: 本次截图未复制，请重新截图。
en: This capture was not copied. Take another screenshot.
ja: このスクリーンショットはコピーされませんでした。もう一度撮影してください。

# status.editingContextUnavailable.title
source: 无法准备原屏快编
en: Unable to prepare quick overlay editing
ja: クイック編集を準備できません

# settings.agentCLI.actionBroker
source: 后台自动化服务
en: Background automation service
ja: バックグラウンド自動化サービス

# settings.agentCLI.actionBroker.disabled
source: 已停用，CLI 无法唤起 App 执行截图。
en: Disabled. CLI screenshot requests cannot start the App.
ja: 無効です。CLI から App のスクリーンショットを開始できません。

# settings.agentCLI.actionBroker.enable
source: 启用后台自动化
en: Enable background automation
ja: バックグラウンド自動化を有効にする

# settings.agentCLI.actionBroker.enabled
source: 已启用，经过验证的命令行请求可以安全唤起 Blocks。
en: Enabled. Verified command line requests can securely open Blocks.
ja: 有効です。検証済みのコマンドライン要求から Blocks を安全に開けます。

# settings.agentCLI.actionBroker.requiresApproval
source: 需要在 macOS 登录项设置中批准。
en: macOS approval is required in Login Items settings.
ja: ログイン項目設定で macOS の承認が必要です。

# settings.agentCLI.actionBroker.unavailable
source: 当前构建中无法使用后台自动化服务。
en: The background automation service is unavailable in this build.
ja: このビルドではバックグラウンド自動化サービスを利用できません。
